package com.vladkano.kotlincourse.lesson3;

public class Kotlin3 {
}

//Для каждого из полей подбери наилучший способ хранения из известных тебе. Учитывай такие факторы, как изменяемость, обязательность, возможность начальной установки, ресурсоёмкие вычисления значения, необходимость проверки устанавливаемого значения на валидность или запрет доступа на установку при возможности чтения, публичность и приватность данных.
//Название мероприятия - done
//Дата проведения - done
//Место проведения - done
//Подробный бюджет мероприятия, включая расходы на оборудование, кейтеринг и другие операционные расходы. - done
//Количество участников
//Длительность хакатона
//Контактная информация и условия соглашений с поставщиками пищи, оборудования и других услуг.
//Текущее состояние хакатона (статус)
//Список спонсоров
//Бюджет мероприятия
//Текущий уровень доступа к интернету
//Информация о транспортировке оборудования, распределении ресурсов и координации между различными командами поддержки.
//        Количество команд
//Перечень задач

//val name_of_the_event: String = "Курсы по автоматизации приложения" //(неизменяемое)
//var date_of_the_event: String = "14 сентября 2024г" //(изменяемое)
//var place_of_the_event: String = "Платформа zoom"
//var budget: Double? = null //(неизвестен)
//var member: Int = 100
//get() = field
//set(value){
//if (value >= 0) field -= value }